# -*- coding: utf-8 -*-
list1 = ['physics', 'chemistry', 1997, 2000];
list2 = [1, 2, 3, 4, 5 ];
list3 = ["a", "b", "c", "d"];

# =============================================================================
# Accessing Values in Lists
# =============================================================================

print ("list1[0]: ", list1[0])
print ("list2[1:5]: ", list2[1:5])

# =============================================================================
# Updating Lists
# =============================================================================
list = ['physics', 'chemistry', 1997, 2000]
print ("Value available at index 2 : ", list[2])

list[2] = 2001
print ("New value available at index 2 : ", list[2])

# =============================================================================
# Delete List Elements
# =============================================================================
list = ['physics', 'chemistry', 1997, 2000]
print (list)

del list[2]
print ("After deleting value at index 2 : ", list)

# =============================================================================
# Basic List Operations
# =============================================================================
print("list of length is %d"%(len([1, 2, 3])))
print("list 合并操作结果:%s"%([1, 2, 3] + [4, 5, 6]))
print("list 乘操作结果:%s"%(['Hi!'] * 4))
print("list in 操作结果:%s"%(3 in [1, 2, 3]))
# list遍历
for x in [1,2,3] : 
    print ("list遍历结果:%s"%(x))
# =============================================================================
# Indexing, Slicing and Matrixes 索引、切片和矩阵
# =============================================================================
L = ['C++', 'Java', 'Python']
print("list of L[2] is %s"%(L[2]))
print("list of L[-2] is %s"%(L[-2]))
print("list of L[1:] is %s"%(L[1:]))
# =============================================================================
# Built-in List Functions and Methods
# =============================================================================
print(len(list2))
print(max(list2))
print(min(list2))
# Converts a tuple into list.新版本api有问题
t = (1,2,3)
#print(list(t))